Repository: porthd/simpledataedittest
Catalog: simpledataedittest/Resources/Private/Language/locallang.xlf
Languages: de

# simpledataedit.message.templateUndefined.1
source: <h2>No Example defined</h2> <div>For ths content-element for the CType `%s` is missing a simpledataedit-example. It may be defined later.</div> <div><strong>Try the content-element `text`.</strong></div>
de: <h2>Kein Beispiel definiert</h2> <div>Für das Content-Element mit dem CType `%s` fehlt eine Beispiel mit simpledataedit. Vielleicht kommt es in Zukunft.</div> <div><strong>Probiere das Content-Element `text`.</strong></div>

# tx_simpledataedittest_domain_model_main
source: Main
de: Hauptordner

# tx_simpledataedittest_domain_model_main.description
source: Description
de: Beschreibung

# tx_simpledataedittest_domain_model_main.my_rte
source: My Rich-Text-Editor
de: Mein Rich-Text-Editor

# tx_simpledataedittest_domain_model_main.title
source: Title
de: Titel

# tx_simpledataedittest_domain_model_main.my_percent
source: My Percent
de: Mein Zahl mit Prozentzeichen

# tx_simpledataedittest_domain_model_main.my_money
source: My Money
de: Mein Geld mit Währungszeichen

# tx_simpledataedittest_domain_model_main.my_float
source: My Float
de: Mein Nachkommazahl

# tx_simpledataedittest_domain_model_main.my_integer
source: My Integer
de: Meine ganze Zahl

# tx_simpledataedittest_domain_model_main.my_boolean
source: My Boolean
de: Mein Wahrheitswert

# tx_simpledataedittest_domain_model_main.my_time
source: My Time
de: Meine Uhrzeit

# tx_simpledataedittest_domain_model_main.my_timesstamp
source: My Timesstamp
de: Mein Zeitstempel

# tx_simpledataedittest_domain_model_main.my_datetime
source: My Datetime
de: Mein Datum und Uhrzeit

# tx_simpledataedittest_domain_model_main.my_images
source: My Images
de: Meine Bilder

# tx_simpledataedittest_domain_model_main.my_files
source: My Files
de: Meine Dateien

# tx_simpledataedittest_domain_model_main.my_list
source: My List
de: Meine Liste

# tx_simpledataedittest_domain_model_main.my_children
source: My Children
de: Meine Kinder

# tx_simpledataedittest_domain_model_main.my_parent
source: My Parent-Data
de: Mein Elter-Datum

# tx_simpledataedittest_domain_model_main.my_peergroup
source: My Peergroup
de: Meine Peergroup

# tx_simpledataedittest_domain_model_main.my_images.moData
source: --- 0 images ---
de: --- 0 Bilder ---

# tx_simpledataedittest_domain_model_main.my_files.moData
source: --- 0 files ---
de: --- 0 Dateien ---

# tx_simpledataedittest_domain_model_main.my_list.moData
source: --- 0 items (Predefined List) ---
de: --- 0 Listeneintrag (vordefiniert) ---

# tx_simpledataedittest_domain_model_main.my_children.moData
source: --- 0 child (1:N) ---
de: --- 0 Kinder (1:N) ---

# tx_simpledataedittest_domain_model_main.my_parent.moData
source: --- 0 parent-data (N:1) ---
de: --- 0 Elter-Daten (N:1) ---

# tx_simpledataedittest_domain_model_main.my_peer.moData
source: --- 0 peer-data (M:N) ---
de: --- 0 Peergruppen-Daten (M:N) ---

# tx_simpledataedittest_domain_model_child
source: Child
de: Kind

# tx_simpledataedittest_domain_model_child.title
source: Title
de: Titel

# tx_simpledataedittest_domain_model_child.description
source: Description
de: Beschreibung

# tx_simpledataedittest_domain_model_progenitor
source: My Parent-Data
de: Elter-Datum

# tx_simpledataedittest_domain_model_progenitor.title
source: Title
de: Titel

# tx_simpledataedittest_domain_model_progenitor.description
source: Description
de: Beschreibung

# tx_simpledataedittest_domain_model_peer.title
source: Title
de: Titel

# tx_simpledataedittest_domain_model_peer.description
source: Description
de: Beschreibung

# tx_simpledataedittest_lister.description
source: Shows, how to use the viewhelper editor in templates.
de: Zeigt, wie der Viewhelper-Editor in Vorlagen verwendet wird.

# factorize.template.factorize.mainHeader.title.fixed
source: Fun-Module Factorize
de: Fun-Modul Faktorisierung

# factorize.template.factorize.warning.recalulated.number.title.fixed
source: The number was recaluclated. Only use digits and make sure, that your number is odd. (input: %s => base of caluclation: %s )
de: Die Eingabe wurde umgearbeitet. Bitte sicherstellen, dass nur Ziffer verwendet werden und dass die Nummer ungerade ist. (Eingabe: %s => Zahl in berechnung: %s )

# factorize.template.factorize.mainPart.form.title.fixed
source: Inputform for number to factorize
de: Eingabeformular für zu faktorisierende Zahl

# factorize.template.factorize.resultPart.factor.form.labelNumber
source: Input odd number
de: Ungrade ganze Zahl eingeben

# factorize.template.factorize.resultPart.factor.form.remark
source: Please note the following when entering: <ol> <li> All characters except digits will be deleted before factorization. </li> <li> Grade numbers are reduced to an odd factor in advance. </li> <li> If necessary, the PHP time limit can prevent a calculation. </li> </ol>
de: Folgendes ist bei der Eingabe zu beachten: <ol> <li>Alle Zeichen außer Ziffern wird vorm Faktorisieren gelöscht. </li> <li>Grade Zahlen werden vorab auf ungraden Faktor reduziert.</li> <li>Gegebenefalls kann das PHP-Zeitlimit eine Berechnung verhindern.</li> </ol>

# factorize.template.factorize.resultPart.factor.form.submit
source: Start Factorizing
de: Start Faktorisierung

# factorize.template.factorize.mainPart.result.title.fixed
source: Results
de: Ergebnisse

# factorize.template.factorize.resultPart.factor.title.fixed
source: First Factorizing
de: Erste Faktorisierung

# factorize.template.factorize.resultPart.factorResult.title.fixed
source: First Factorizing
de: Erste Faktorisierung

# factorize.template.factorize.resultPart.factor.remark.timegap.1
source: It needed %s seconds for calculation.
de: Die Berechnung dauerte %s Sekunden.

# factorize.template.factorize.resultPart.notify.factorize.product
source: The product could be factored successfully. The specific products can possibly. further factorized.
de: Das Produkt konnte erfolgreich faktorisiert werden. Die bestimmten Produkten können ggfls. weiter faktorisiert werden.

# factorize.template.factorize.resultPart.notify.prime.product
source: The product could not be factored successfully. The number is prime.
de: Das Produkt konnte nicht erfolgreich faktorisiert werden. Die Zahl ist prim.

# factorize.template.factorize.resultPart.factor.row.product
source: Raw input for the number
de: Roh-Eingabe für die Zahl

# factorize.template.factorize.resultPart.factor.row.smalFactor
source: Factor with a maximum of half the bit length of the product
de: Faktor mit höchstens halber Bitlänge des Produkts

# factorize.template.factorize.resultPart.factor.row.bigFactor
source: Factor rounded off at least half the bit length of the product
de: Faktor mit mindestens abgerundet halber Bitlänge des Produkts

# factorize.template.factorize.resultPart.factor.form.labelFactorLeft
source: Info about used factor left
de: Information zum genutzten Faktor links

# factorize.template.factorize.resultPart.factor.form.labelFactorRight
source: Info about used factor right
de: Information zum genutzten Faktor rechts

# factorize.template.factorize.resultPart.factor.row.infoLeft
source: Info about used factor left
de: Information zum genutzten Faktor links

# factorize.template.factorize.resultPart.factor.row.infoRight
source: Info about used factor right
de: Information zum genutzten Faktor rechts

# factorize.template.factorize.resultPart.statistic.title.fixed
source: statistics about factorizing
de: Statistiken zur Faktorisierung

# factorize.template.factorize.resultPart.statistic.title.global
source: Counts over all bit-length-variations
de: Zählungen gemeinsam für alle Bit-Längen-Proportionen

# factorize.template.factorize.resultPart.statistic.title.vary
source: Counts for each bit-length-variation
de: Zählungen für Ereignisse separat für jede Bit-Längen-Variation

# factorize.template.factorize.resultPart.tableHeader.count.vary
source: bit-length-variation
de: Bit-Längen-Verhältnis

# factorize.template.factorize.resultPart.tableHeader.count.fail
source: fail-checks
de: Fehler-Check

# factorize.template.factorize.resultPart.tableHeader.count.never
source: never-check
de: niemals-Check

# general.partial.relatedObject.field.title
source: title
de: Titel

# general.partial.relatedObject.field.description
source: description
de: Beschreibung
